In [3]:
import pandas as pd
df = pd.DataFrame()
df = pd.read_csv('drinks.csv')
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [4]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [5]:
df.drop(['total_litres_of_pure_alcohol'], axis=1, inplace=True)

In [6]:
print(len(df.index))

193

In [7]:
df = df.set_index('country')

In [8]:
df.sample(n=5)

                      beer_servings  spirit_servings  wine_servings
country
Canada                          240              122            100
Antigua & Barbuda               102              128             45
Croatia                         230               87            254
Kiribati                         21               34              1
United Arab Emirates             16              135              5

In [9]:
for i in df.index:
    print(i)

Afghanistan
Albania
Algeria
Andorra
Angola
Antigua & Barbuda
Argentina
Armenia
Australia
Austria
Azerbaijan
Bahamas
Bahrain
Bangladesh
Barbados
Belarus
Belgium
Belize
Benin
Bhutan
Bolivia
Bosnia-Herzegovina
Botswana
Brazil
Brunei
Bulgaria
Burkina Faso
Burundi
Cote d'Ivoire
Cabo Verde
Cambodia
Cameroon
Canada
Central African Republic
Chad
Chile
China
Colombia
Comoros
Congo
Cook Islands
Costa Rica
Croatia
Cuba
Cyprus
Czech Republic
North Korea
DR Congo
Denmark
Djibouti
Dominica
Dominican Republic
Ecuador
Egypt
El Salvador
Equatorial Guinea
Eritrea
Estonia
Ethiopia
Fiji
Finland
France
Gabon
Gambia
Georgia
Germany
Ghana
Greece
Grenada
Guatemala
Guinea
Guinea-Bissau
Guyana
Haiti
Honduras
Hungary
Iceland
India
Indonesia
Iran
Iraq
Ireland
Israel
Italy
Jamaica
Japan
Jordan
Kazakhstan
Kenya
Kiribati
Kuwait
Kyrgyzstan
Laos
Latvia
Lebanon
Lesotho
Liberia
Libya
Lithuania
Luxembourg
Madagascar
Malawi
Malaysia
Maldives
Mali
Malta
Marshall Islands
Mauritania
Mauritius
Mexico
Micronesia
Monaco
Mongolia
Montenegro
Morocco
Mozambique
Myanmar
Namibia
Nauru
Nepal
Netherlands
New Zealand
Nicaragua
Niger
Nigeria
Niue
Norway
Oman
Pakistan
Palau
Panama
Papua New Guinea
Paraguay
Peru
Philippines
Poland
Portugal
Qatar
South Korea
Moldova
Romania
Russian Federation
Rwanda
St. Kitts & Nevis
St. Lucia
St. Vincent & the Grenadines
Samoa
San Marino
Sao Tome & Principe
Saudi Arabia
Senegal
Serbia
Seychelles
Sierra Leone
Singapore
Slovakia
Slovenia
Solomon Islands
Somalia
South Africa
Spain
Sri Lanka
Sudan
Suriname
Swaziland
Sweden
Switzerland
Syria
Tajikistan
Thailand
Macedonia
Timor-Leste
Togo
Tonga
Trinidad & Tobago
Tunisia
Turkey
Turkmenistan
Tuvalu
Uganda
Ukraine
United Arab Emirates
United Kingdom
Tanzania
USA
Uruguay
Uzbekistan
Vanuatu
Venezuela
Vietnam
Yemen
Zambia
Zimbabwe

In [12]:
df['beer_servings'].idxmax()

'Namibia'

In [13]:
df['wine_servings'].idxmax()

'France'

In [14]:
no_spirits = df[df['spirit_servings'] == 0]

In [15]:
print(len(no_spirits))

23

In [16]:
no_spirits

                   beer_servings  spirit_servings  wine_servings
country
Afghanistan                    0                0              0
Algeria                       25                0             14
Bangladesh                     0                0              0
Bhutan                        23                0              0
Burundi                       88                0              0
North Korea                    0                0              0
Equatorial Guinea             92                0            233
Eritrea                       18                0              0
Gambia                         8                0              1
Guinea                         9                0              2
Iran                           0                0              0
Kuwait                         0                0              0
Laos                          62                0            123
Libya                          0                0              0
Maldives                       0                0              0
Marshall Islands               0                0              0
Mauritania                     0                0              0
Monaco                         0                0              0
Nauru                         49                0              8
Pakistan                       0                0              0
San Marino                     0                0              0
Somalia                        0                0              0
Yemen                          6                0              0

In [20]:
no_alcohol = df[(df['beer_servings'] == 0) & (df['spirit_servings'] == 0) & (df['wine_servings'] == 0)]

In [21]:
no_alcohol

                  beer_servings  spirit_servings  wine_servings
country
Afghanistan                   0                0              0
Bangladesh                    0                0              0
North Korea                   0                0              0
Iran                          0                0              0
Kuwait                        0                0              0
Libya                         0                0              0
Maldives                      0                0              0
Marshall Islands              0                0              0
Mauritania                    0                0              0
Monaco                        0                0              0
Pakistan                      0                0              0
San Marino                    0                0              0
Somalia                       0                0              0

In [23]:
print("No alcohol: " + str(len(no_alcohol)) + "/" + str(len(df)) + " countries.")

No alcohol: 13/193 countries.

In [24]:
df['beer_servings'].sum()

20489

In [25]:
df['wine_servings'].sum()

9544

In [26]:
df['spirit_servings'].sum()

15632

In [27]:
df[(df.loc['United Kingdom','beer_servings'] < df.loc[:,'beer_servings']) &
   (df.loc['United Kingdom','wine_servings'] < df.loc[:,'wine_servings']) &
   (df.loc['United Kingdom','spirit_servings'] < df.loc[:,'spirit_servings']) ]

            beer_servings  spirit_servings  wine_servings
country
Andorra               245              138            312
Luxembourg            236              133            271

In [28]:
df.loc['Greece']

beer_servings      133
spirit_servings    112
wine_servings      218
Name: Greece, dtype: int64